src/cf/InformationRegisters/НомераСправочниковИДокументовДляИзмененияНаКлиентскомУзлеМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НомераСправочниковИДокументовДляИзмененияНаКлиентскомУзлеМП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КодУзла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказМП</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходДенегМП</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажахМП</v8:Type>
						<v8:Type>cfg:CatalogRef.СпецификацииМП</v8:Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДСМП</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекККММП</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницыМП</v8:Type>
						<v8:Type>cfg:CatalogRef.СтатьиМП</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходТовараМП</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтрагентыМП</v8:Type>
						<v8:Type>cfg:CatalogRef.ТоварыМП</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекККМВозвратМП</v8:Type>
						<v8:Type>cfg:CatalogRef.КассыККММП</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходТовараМП</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковМП</v8:Type>
						<v8:Type>cfg:DocumentRef.ПроизводствоМП</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходДенегМП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/НомераСправочниковИДокументовДляИзмененияНаКлиентскомУзлеМП/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаписатьИнформацию(Структура) Экспорт
	
	НаборЗаписей = РегистрыСведений.НомераСправочниковИДокументовДляИзмененияНаКлиентскомУзлеМП.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Ссылка.Установить(Структура.Ссылка);
	НаборЗаписей.Отбор.КодУзла.Установить(Структура.КодУзла);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	Для Каждого Элемент Из Структура Цикл
		НоваяЗапись[Элемент.Ключ] = Элемент.Значение;
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Функция ПроверитьНаличиеДанных(КодУзла) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НомераСправочниковИДокументовДляИзмененияНаКлиентскомУзлеМП.Ссылка КАК Ссылка,
		|	НомераСправочниковИДокументовДляИзмененияНаКлиентскомУзлеМП.Номер КАК Номер
		|ИЗ
		|	РегистрСведений.НомераСправочниковИДокументовДляИзмененияНаКлиентскомУзлеМП КАК НомераСправочниковИДокументовДляИзмененияНаКлиентскомУзлеМП
		|ГДЕ
		|	НомераСправочниковИДокументовДляИзмененияНаКлиентскомУзлеМП.КодУзла = &КодУзла";
	
	Запрос.УстановитьПараметр("КодУзла", КодУзла);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивСЗаписями = Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Структура = Новый Структура("Ссылка, Номер", ВыборкаДетальныеЗаписи.Ссылка, ВыборкаДетальныеЗаписи.Номер);
		МассивСЗаписями.Добавить(Структура);
	КонецЦикла;
	
	Возврат МассивСЗаписями

КонецФункции

Процедура УдалитьЗаписи(КодУзла) Экспорт
	
	НаборЗаписей = РегистрыСведений.НомераСправочниковИДокументовДляИзмененияНаКлиентскомУзлеМП.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.КодУзла.Установить(КодУзла);
	НаборЗаписей.Записать();

КонецПроцедуры

Процедура УдалитьЗапись(Ссылка) Экспорт
	
	НаборЗаписей = РегистрыСведений.НомераСправочниковИДокументовДляИзмененияНаКлиентскомУзлеМП.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ссылка.Установить(Ссылка);
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура УдалитьЗаписьДляЦентральногоУзла(КодУзла, Ссылка) Экспорт
	
	НаборЗаписей = РегистрыСведений.НомераСправочниковИДокументовДляИзмененияНаКлиентскомУзлеМП.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ссылка.Установить(Ссылка);
	НаборЗаписей.Отбор.КодУзла.Установить(КодУзла);
	НаборЗаписей.Записать();

КонецПроцедуры

#КонецОбласти

#КонецЕсли
